notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-08-22 Tue 18:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Deep Learning A-Z: Hands-On AI</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Deep Learning A-Z: Hands-On AI</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8d04745">0.1. Section 1: Welcome to the Course</a>
<ul>
<li><a href="#orged6304c">0.1.1. What is Deep Learning</a></li>
<li><a href="#orgc8f236d">0.1.2. Installing Python</a></li>
<li><a href="#orgcfee43e">0.1.3. Getting The Dataset</a></li>
</ul>
</li>
<li><a href="#orgc3969a5">0.2. Section 2: Artificial Neural Networks</a></li>
</ul>
</li>
<li><a href="#org94b7760">1. Part 1</a>
<ul>
<li><a href="#orgd02f5b0">1.1. Section 3: ANN Intuition</a>
<ul>
<li><a href="#org1791296">1.1.1. Plan of Attack</a></li>
<li><a href="#orgae4b9fb">1.1.2. The Neuron</a></li>
<li><a href="#org3bdeffa">1.1.3. The Activation Function</a></li>
<li><a href="#org4dd802f">1.1.4. How do Neural Networks work?</a></li>
<li><a href="#org6775442">1.1.5. How do Neural Networks learn?</a></li>
<li><a href="#org2313db3">1.1.6. Gradient Descent</a></li>
<li><a href="#org85ed7dd">1.1.7. Stochastic Gradient Descent</a></li>
<li><a href="#org9167c91">1.1.8. Backpropagatio</a></li>
</ul>
</li>
<li><a href="#org4e788a0">1.2. Section 4: Building an ANN</a></li>
<li><a href="#org5cb2e7c">1.3. Section 5: Homework Challenge - Should we say goodbye to that customer?</a></li>
<li><a href="#org6d910d7">1.4. Section 6: Evaluation, Improving and Tuning the ANN</a></li>
<li><a href="#org28b47a9">1.5. Section 7: Homework Challenge - Put me one step down on the podium</a></li>
<li><a href="#org5b097e7">1.6. Section 8: Convolutional Neural Networks</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8d04745" class="outline-3">
<h3 id="org8d04745"><span class="section-number-3">0.1</span> Section 1: Welcome to the Course</h3>
<div class="outline-text-3" id="text-0-1">
<p>
8/21/2017
</p>
</div>

<div id="outline-container-orged6304c" class="outline-4">
<h4 id="orged6304c"><span class="section-number-4">0.1.1</span> What is Deep Learning</h4>
<div class="outline-text-4" id="text-0-1-1">
<ul class="org-ul">
<li>Geoffrey Hinton - Godfather of DL. Check out youtube videos.</li>
<li>Artificial Neural Nets
<ul class="org-ul">
<li>Made up of nodes
<ul class="org-ul">
<li>Input Nodes - Input Layer (known values)</li>
<li>Output Nodes - Output Layer (values to predict)</li>
<li>Hidden Layer - Between input and output layer.</li>
</ul></li>
<li>Input -&gt; Hidden -&gt; Output</li>
<li>Deep Learning comes in when there are multiple hidden layers.</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgc8f236d" class="outline-4">
<h4 id="orgc8f236d"><span class="section-number-4">0.1.2</span> Installing Python</h4>
<div class="outline-text-4" id="text-0-1-2">
<ul class="org-ul">
<li>Install Anaconda Python (version 3.5)</li>
<li>Launch Spyder through Anaconda Navigator</li>
</ul>
</div>
</div>

<div id="outline-container-orgcfee43e" class="outline-4">
<h4 id="orgcfee43e"><span class="section-number-4">0.1.3</span> Getting The Dataset</h4>
<div class="outline-text-4" id="text-0-1-3">
<p>
<a href="http://superdatascience.com/deep-learning">http://superdatascience.com/deep-learning</a>
</p>

<ul class="org-ul">
<li>Download Deep Learning A-Z Folder Template</li>
<li>Download the dataset for each part of the course</li>
<li>Look into Additional Reading mentioned throughout course</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgc3969a5" class="outline-3">
<h3 id="orgc3969a5"><span class="section-number-3">0.2</span> Section 2: Artificial Neural Networks</h3>
</div>

<div id="outline-container-org94b7760" class="outline-2">
<h2 id="org94b7760"><span class="section-number-2">1</span> Part 1</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgd02f5b0" class="outline-3">
<h3 id="orgd02f5b0"><span class="section-number-3">1.1</span> Section 3: ANN Intuition</h3>
<div class="outline-text-3" id="text-1-1">
</div><div id="outline-container-org1791296" class="outline-4">
<h4 id="org1791296"><span class="section-number-4">1.1.1</span> Plan of Attack</h4>
<div class="outline-text-4" id="text-1-1-1">
<ul class="org-ul">
<li>What we will learn in this section:
<ul class="org-ul">
<li>The Neuron</li>
<li>The Activation Function</li>
<li>How do neural networks work? (example)</li>
<li>How do neural networks learn?</li>
<li>Gradient Descent</li>
<li>Stochastic Gradient Descent</li>
<li>Backprogation</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgae4b9fb" class="outline-4">
<h4 id="orgae4b9fb"><span class="section-number-4">1.1.2</span> The Neuron</h4>
<div class="outline-text-4" id="text-1-1-2">
<ul class="org-ul">
<li>Basic building block of Artificial Neural Networks</li>
<li>Neurons by themselves are useless. With lots of neurons, they work together.</li>
<li>Dendrites are receivers of the signal and Axon is transmitter.</li>
<li>Synapses - Term for connector that passes signal.</li>

<li>Recreating on machine
<ul class="org-ul">
<li>Neuron (node)
<ul class="org-ul">
<li>Receives input (from input layer or other hidden layer neurons)</li>
<li>Generates output (to output layer or other hidden layer neurons)</li>
<li>Connected via synapses</li>
</ul></li>
<li>Input Values
<ul class="org-ul">
<li>Independent variables</li>
<li>All for one single observation (one row in your database)</li>
<li>Need to be standadized (mean 0; variance: 1) or normalized (get values between 0 and 1)
<ul class="org-ul">
<li>Easier for neural network to process</li>
</ul></li>
</ul></li>
<li>Output Values
<ul class="org-ul">
<li>Continous, Binary, Categorical (several output values)</li>
<li>All for one single observation</li>
</ul></li>
<li>Synapses
<ul class="org-ul">
<li>All assigned weights.</li>
<li>Weights is how the neural net works learn. By adjusting weights, neural net decides which signal gets passed along or not</li>
<li>Signals are sent into the neuron where they are added (weighted sum) of all input values and applies an activation function</li>
<li>Decision is made based on function whether signal will pass on or not</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org3bdeffa" class="outline-4">
<h4 id="org3bdeffa"><span class="section-number-4">1.1.3</span> The Activation Function</h4>
<div class="outline-text-4" id="text-1-1-3">
<ul class="org-ul">
<li>Threshold Function
<ul class="org-ul">
<li>1 if x &gt;= 0 | 0 if x &lt; 0 (yes or no)</li>
</ul></li>
<li>Sigmoid Function
<ul class="org-ul">
<li>\(\frac{1}{1 + e^{-x}}\) (used in logistic regression)</li>
<li>Smooth gradual progression</li>
<li>Very useful in output layer</li>
</ul></li>
<li>Rectifier Function
<ul class="org-ul">
<li>\(max(x,0)\)</li>
<li>One of most used</li>
</ul></li>
<li>Hyperbolic Tangent (tahn)
<ul class="org-ul">
<li>\(\frac{1 - e^{-2x}}{ 1 + e^{-2x}}\)</li>
<li>Can go below 0</li>
</ul></li>

<li>Exercise 1
<ul class="org-ul">
<li>Assuming DV is binary (y = 0 or 1)
<ul class="org-ul">
<li>Threshold Function</li>
<li>Sigmoid Function (probability of y being 1 or not)</li>
</ul></li>
</ul></li>
<li>Exercise 2
<ul class="org-ul">
<li>In hidden layer apply rectifier</li>
<li>Output layer applies sigmoid function</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org4dd802f" class="outline-4">
<h4 id="org4dd802f"><span class="section-number-4">1.1.4</span> How do Neural Networks work?</h4>
</div>

<div id="outline-container-org6775442" class="outline-4">
<h4 id="org6775442"><span class="section-number-4">1.1.5</span> How do Neural Networks learn?</h4>
</div>

<div id="outline-container-org2313db3" class="outline-4">
<h4 id="org2313db3"><span class="section-number-4">1.1.6</span> Gradient Descent</h4>
</div>

<div id="outline-container-org85ed7dd" class="outline-4">
<h4 id="org85ed7dd"><span class="section-number-4">1.1.7</span> Stochastic Gradient Descent</h4>
</div>


<div id="outline-container-org9167c91" class="outline-4">
<h4 id="org9167c91"><span class="section-number-4">1.1.8</span> Backpropagatio</h4>
</div>
</div>


<div id="outline-container-org4e788a0" class="outline-3">
<h3 id="org4e788a0"><span class="section-number-3">1.2</span> Section 4: Building an ANN</h3>
</div>

<div id="outline-container-org5cb2e7c" class="outline-3">
<h3 id="org5cb2e7c"><span class="section-number-3">1.3</span> Section 5: Homework Challenge - Should we say goodbye to that customer?</h3>
</div>

<div id="outline-container-org6d910d7" class="outline-3">
<h3 id="org6d910d7"><span class="section-number-3">1.4</span> Section 6: Evaluation, Improving and Tuning the ANN</h3>
</div>

<div id="outline-container-org28b47a9" class="outline-3">
<h3 id="org28b47a9"><span class="section-number-3">1.5</span> Section 7: Homework Challenge - Put me one step down on the podium</h3>
</div>

<div id="outline-container-org5b097e7" class="outline-3">
<h3 id="org5b097e7"><span class="section-number-3">1.6</span> Section 8: Convolutional Neural Networks</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-08-22 Tue 18:31</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
